simulation/airfoil_smooth/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0.8 0 0);
    }

    outlet
    {
        type            inletOutlet;
	    inletValue	    uniform (0 0 0);
	    value 		    $internalField;
    }

    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    airfoil
    {
        type            fixedValue;
	    value 		    uniform (0 0 0);
    }

}

// ************************************************************************* //
