simulation/airfoil_smooth/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;       //Transport Properties calculates how a fluid's internal properties—specifically its viscosity, thermal conductivity, and thermal diffusivity—change under different physical conditions
                                // Newtonian: Assumes viscosity stays constant regardless of the shear rate (e.g., water, air).
nu              [0 2 -1 0 0 0 0] 1e-06;   

// ************************************************************************* //
